/* Паркінг може обробити максимум 7 автомобілів.

Для кожного автомобіля користувач вводить:
1. кількість годин стоянки;
2. тип автомобіля:
   1 — звичайний;
   2 — електромобіль.

Правила:
- якщо замість кількості годин введено 0 — обробку автомобілів потрібно завершити достроково;
- якщо введено кількість годин менше 0 або більше 12 — такий запис пропустити;
- звичайний автомобіль: 40 грн за годину;
- електромобіль: 30 грн за годину;
- якщо автомобіль стояв більше 5 годин — від підсумкової вартості відняти 20%;
- якщо тип автомобіля не 1 і не 2 — вивести повідомлення про помилку і перейти до наступного автомобіля.

Після завершення програма повинна вивести:
- кількість правильно оброблених автомобілів;
- кількість електромобілів;
- загальну суму оплати;
- найбільшу оплату за один автомобіль.

Обов'язково використати:
- цикл for;
- if / else;
- break;
- continue. */
const max = 7;
let countCorrect = 0;
let countElectro = 0;
let cost = 0;
let sum = 0;
let maxPrice = 0;
let hours = +prompt("Введіть кількість годин");
let variantsType = prompt("Введіть тип автомобіля: 1-звичайний, 2-електромобіль");
while (isNaN(hours)) {
    hours = +prompt("Введіть кількість годин");
    if (hours = 0) {
        break;
    } else if (hours < 0 && hours > 12) {
        continue;
    }
    for (let i = 1; i <= max; i++) {
        switch (variantsType[i]) {
            case 1:
                cost = hours * 40;
            case 2:
                cost = hours * 30;
        }
    }
}

alert(`${countCorrect} - кількість правильно оброблених автомобілів;
${countElectro} - кількість електромобілів;
${sum}- загальну суму оплати;
${maxPrice} - найбільшу оплату за один автомобіль.`)