/* Правильний PIN-код:
2026

Користувач має максимум 3 спроби.

Програма повинна:
- запитувати PIN-код;
- якщо код правильний — вивести "Доступ дозволено" і завершити цикл;
- якщо код неправильний — повідомити, скільки спроб залишилося;
- після третьої невдалої спроби вивести "Доступ заблоковано".

Використайте цикл while АБО do...while.
Для дострокового завершення після правильного PIN-коду використайте break.

Приклад:
PIN: 1111
Залишилося спроб: 2

PIN: 2026
Доступ дозволено */



// const pin = 2026;
// let n = 3;
// let attemp = 0;
// let userPin = +prompt("Enter your pin:");
// while (n !== 0){
//     if (userPin === 2026) {
//         alert("Доступ дозволено");
//         break;
//     } else if {
//         attemp ++
//         n = n - attemp
//         alert(`Залишилось ${n} спроб`)
//         continue;
//     } else{
//         alert('Доступ заблоковано')
//     }
// }